In [1]:
 import numpy as np

 import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20130101", periods=6)

print(dates)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
print(df)

                   A         B         C         D
2013-01-01 -0.252282  0.785418  0.690153 -0.510640
2013-01-02  0.182132  0.120818  0.215721 -1.053122
2013-01-03  0.711736  0.740896  0.044078 -1.838124
2013-01-04  1.131547  0.140290 -0.327818 -1.273202
2013-01-05  2.012423  0.377411 -0.808310 -2.868135
2013-01-06 -1.568683  0.698683  0.251194  0.307066

In [5]:
df2 = pd.DataFrame(
   ...:     {
   ...:         "A": 1.0,
   ...:         "B": pd.Timestamp("20130102"),
   ...:         "C": pd.Series(1, index=list(range(4)), dtype="float32"),
   ...:         "D": np.array([3] * 4, dtype="int32"),
   ...:         "E": pd.Categorical(["test", "train", "test", "train"]),
   ...:         "F": "foo",
   ...:     }
   ...: )
print(df)

                   A         B         C         D
2013-01-01 -0.252282  0.785418  0.690153 -0.510640
2013-01-02  0.182132  0.120818  0.215721 -1.053122
2013-01-03  0.711736  0.740896  0.044078 -1.838124
2013-01-04  1.131547  0.140290 -0.327818 -1.273202
2013-01-05  2.012423  0.377411 -0.808310 -2.868135
2013-01-06 -1.568683  0.698683  0.251194  0.307066

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -0.252282  0.785418  0.690153 -0.510640
2013-01-02  0.182132  0.120818  0.215721 -1.053122
2013-01-03  0.711736  0.740896  0.044078 -1.838124
2013-01-04  1.131547  0.140290 -0.327818 -1.273202
2013-01-05  2.012423  0.377411 -0.808310 -2.868135

In [8]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.131547  0.140290 -0.327818 -1.273202
2013-01-05  2.012423  0.377411 -0.808310 -2.868135
2013-01-06 -1.568683  0.698683  0.251194  0.307066

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.to_numpy()

array([[-0.25228222,  0.78541788,  0.69015301, -0.51063991],
       [ 0.18213207,  0.12081775,  0.21572115, -1.05312197],
       [ 0.71173571,  0.74089582,  0.04407809, -1.83812423],
       [ 1.13154722,  0.14029043, -0.32781819, -1.27320192],
       [ 2.01242347,  0.37741062, -0.80830984, -2.86813539],
       [-1.56868346,  0.69868251,  0.25119441,  0.30706601]])

In [11]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [12]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.369479  0.477253  0.010836 -1.206026
std    1.230879  0.304651  0.519233  1.092068
min   -1.568683  0.120818 -0.808310 -2.868135
25%   -0.143679  0.199570 -0.234844 -1.696894
50%    0.446934  0.538047  0.129900 -1.163162
75%    1.026594  0.730342  0.242326 -0.646260
max    2.012423  0.785418  0.690153  0.307066

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.252282    0.182132    0.711736    1.131547    2.012423   -1.568683
B    0.785418    0.120818    0.740896    0.140290    0.377411    0.698683
C    0.690153    0.215721    0.044078   -0.327818   -0.808310    0.251194
D   -0.510640   -1.053122   -1.838124   -1.273202   -2.868135    0.307066

In [14]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-02  0.182132  0.120818  0.215721 -1.053122
2013-01-04  1.131547  0.140290 -0.327818 -1.273202
2013-01-05  2.012423  0.377411 -0.808310 -2.868135
2013-01-06 -1.568683  0.698683  0.251194  0.307066
2013-01-03  0.711736  0.740896  0.044078 -1.838124
2013-01-01 -0.252282  0.785418  0.690153 -0.510640

In [15]:
df["A"]

2013-01-01   -0.252282
2013-01-02    0.182132
2013-01-03    0.711736
2013-01-04    1.131547
2013-01-05    2.012423
2013-01-06   -1.568683
Freq: D, Name: A, dtype: float64

In [16]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.252282  0.785418  0.690153 -0.510640
2013-01-02  0.182132  0.120818  0.215721 -1.053122
2013-01-03  0.711736  0.740896  0.044078 -1.838124

In [17]:
df.loc[dates[0]]

A   -0.252282
B    0.785418
C    0.690153
D   -0.510640
Name: 2013-01-01 00:00:00, dtype: float64

In [18]:
df.loc["20130102", ["A", "B"]]

A    0.182132
B    0.120818
Name: 2013-01-02 00:00:00, dtype: float64

In [19]:
df.iloc[3]

A    1.131547
B    0.140290
C   -0.327818
D   -1.273202
Name: 2013-01-04 00:00:00, dtype: float64

In [20]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.182132  0.215721
2013-01-03  0.711736  0.044078
2013-01-05  2.012423 -0.808310

In [21]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.785418  0.690153
2013-01-02  0.120818  0.215721
2013-01-03  0.740896  0.044078
2013-01-04  0.140290 -0.327818
2013-01-05  0.377411 -0.808310
2013-01-06  0.698683  0.251194

In [22]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-02  0.182132  0.120818  0.215721 -1.053122
2013-01-03  0.711736  0.740896  0.044078 -1.838124
2013-01-04  1.131547  0.140290 -0.327818 -1.273202
2013-01-05  2.012423  0.377411 -0.808310 -2.868135

In [23]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
print(s1)

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [24]:
df.at[dates[0], "A"] = 0

In [25]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [26]:
 df1.loc[dates[0] : dates[1], "E"] = 1

In [27]:
print(df1)

                   A         B         C         D    E
2013-01-01  0.000000  0.785418  0.690153 -0.510640  1.0
2013-01-02  0.182132  0.120818  0.215721 -1.053122  1.0
2013-01-03  0.711736  0.740896  0.044078 -1.838124  NaN
2013-01-04  1.131547  0.140290 -0.327818 -1.273202  NaN

In [28]:
df1.dropna(how="any")

                   A         B         C         D    E
2013-01-01  0.000000  0.785418  0.690153 -0.510640  1.0
2013-01-02  0.182132  0.120818  0.215721 -1.053122  1.0

In [29]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01  0.000000  0.785418  0.690153 -0.510640  1.0
2013-01-02  0.182132  0.120818  0.215721 -1.053122  1.0
2013-01-03  0.711736  0.740896  0.044078 -1.838124  5.0
2013-01-04  1.131547  0.140290 -0.327818 -1.273202  5.0

In [30]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [31]:
df.mean()

A    0.411526
B    0.477253
C    0.010836
D   -1.206026
dtype: float64

In [32]:
df.mean(1)

2013-01-01    0.241233
2013-01-02   -0.133613
2013-01-03   -0.085354
2013-01-04   -0.082296
2013-01-05   -0.321653
2013-01-06   -0.077935
Freq: D, dtype: float64

In [33]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
print(s)

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [34]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.000000  0.785418  0.690153 -0.510640
2013-01-02  0.182132  0.906236  0.905874 -1.563762
2013-01-03  0.893868  1.647131  0.949952 -3.401886
2013-01-04  2.025415  1.787422  0.622134 -4.675088
2013-01-05  4.037838  2.164832 -0.186176 -7.543223
2013-01-06  2.469155  2.863515  0.065019 -7.236157

In [35]:
s = pd.Series(np.random.randint(0, 7, size=10))
print(s)

0    2
1    6
2    5
3    5
4    6
5    5
6    5
7    1
8    3
9    6
dtype: int32

In [36]:
s.value_counts()

5    4
6    3
1    1
2    1
3    1
dtype: int64

In [37]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])

In [38]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [39]:
df = pd.DataFrame(np.random.randn(10, 4))

In [40]:
print(df)

          0         1         2         3
0 -1.785115  0.440563 -0.092945 -1.425157
1  0.594783  0.220599 -0.195339  0.323183
2 -0.022232  0.923624  0.678617  1.284517
3  1.504853 -0.019907 -0.063051  1.071774
4 -2.451805  0.021173 -0.929693 -0.367021
5 -0.758581 -1.363816 -0.326941 -0.305078
6  2.094156  1.664563  1.118877 -0.818865
7  0.408562 -0.354237 -0.076194  0.178313
8 -0.501082  1.999565  2.442050 -0.710381
9 -0.185983  1.441293  0.579136  0.338189

In [41]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
print(left)

   key  lval
0  foo     1
1  foo     2

In [42]:
print(right)

   key  rval
0  foo     4
1  foo     5

In [43]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [44]:
df = pd.DataFrame(
   ....:     {
   ....:         "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
   ....:         "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
   ....:         "C": np.random.randn(8),
   ....:         "D": np.random.randn(8),
   ....:     }
   ....: )

In [45]:
print(df)

     A      B         C         D
0  foo    one -0.703459 -0.969071
1  bar    one -1.550162 -0.516939
2  foo    two -0.333746 -0.578540
3  bar  three -0.223261  0.449833
4  foo    two -0.771392  2.463234
5  bar    two -0.894691  1.754675
6  foo    one -0.086657  1.462992
7  foo  three  0.834634 -1.097619

In [46]:
df.groupby("A").sum()

            C         D
A
bar -2.668114  1.687569
foo -1.060620  1.280996

In [47]:
tuples = list(
   ....:     zip(
   ....:         *[
   ....:             ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ....:             ["one", "two", "one", "two", "one", "two", "one", "two"],
   ....:         ]
   ....:     )
   ....: )
   ....:

In [48]:
index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])

In [49]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])

In [50]:
df2 = df[:4]

print(df2)

                     A         B
first second
bar   one     0.927643 -0.769281
      two    -0.031977 -1.696760
baz   one     0.090157  0.540456
      two     0.561524  0.752431

In [51]:
stacked = df2.stack()
print(stacked)

first  second
bar    one     A    0.927643
               B   -0.769281
       two     A   -0.031977
               B   -1.696760
baz    one     A    0.090157
               B    0.540456
       two     A    0.561524
               B    0.752431
dtype: float64